tutorials/oneWayCoupledCrysPBEFoam/shearIlievski/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2606
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 318.15;

boundaryField
{
    walls
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0 318.15)
            (13800 295.15)
        );
        value           uniform 318.15;
    }
}

// ************************************************************************* //
